---
type: AssetPropertyDoubleArray3d
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 4
tags: [revit-api, class]
---

# AssetPropertyDoubleArray3d

`Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetValueAsDoubles | — | `public IList < double > GetValueAsDoubles ()` |
| Method | GetValueAsXYZ | — | `public XYZ GetValueAsXYZ ()` |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( XYZ xyz )` |
| Method | SetValueAsXYZ | — | `public void SetValueAsXYZ ( XYZ xyz )` |